// 예제 6-15.cpp
// 포인터 배열에 1차원 배열의 주소값 저장하기

// p[0] == a == &a[0]  ==>>  *p[0] == *a == *&a[0] == a[0]

#include <iostream>
using namespace std;

void main()
{
	int a[5] = { 10,20,30,40,50 };
	int b[5] = { 60,70,80,90,100 };
	int c[5] = { 110,120,130,140,150 };

	int* p[3] = { a,b,c };		// p[0] == a == &a[0],  p[1] == b == &b[0],  p[2] == c == &c[0]
	
	cout << " >> 각 1차원 배열의 첫번째 원소 출력 <<" << endl;
	cout << p[0][0] << "\t" << p[1][0] << "\t" << p[2][0] << "\n" << endl;

	cout << " >> 각 1차원 배열의 두번째 원소 출력 <<" << endl;
	cout << p[0][1] << "\t" << p[1][1] << "\t" << p[2][1] << endl;
}
